# 12. Составить программу решения линейного уравнения ах + b = 0 (a ≠ 0)
print('Линейное уравнение: ах + b = 0 (a ≠ 0) ')
a = int(input("Введите коэфф а: "))
b = int(input("Введите коэфф b: "))
print(f"x = {-b / a}")