# 13. Дано целое число, большее 99. Найти третью от конца его цифру (так, если данное число 2345,
# то искомая цифра 3).
a = input("Введите число > 99: ")
print("Третья с конца цифра -", a[-3])