# 2. Пользователь вводит текст. Заменить в тексте слова «ПК» на «компьютер», подсчитав их количество.
a = input()
print(a.count("ПК"))
print(a.replace("ПК", "компьютер"))
