# 9. Пользователь вводит текст. Вывести исходный текст, заменив в нем слово «Pascal» на «C++» и подсчитав их количество
a = input()
print(a.replace("Pascal", "C++"))
print(a.count("Pascal"))

# Я Люблю Pascal и на нем легко писать программы 🎅🤶👼