# Дана строка «Низкоуровневый язык — это когда требуется внимание к вещам, которые никак не связаны с программами на этом языке»
# Вывести  слово «язык» на экран с помощью среза  (10 баллов)
s = "Низкоуровневый язык — это когда требуется внимание к вещам, которые никак не связаны с программами на этом языке"
print(s[-5:-1])