# 2.Пользователь вводит текст. Вывести исходный текст, заменив  в нем слово «проблема» на «задача». Удалить все слова «Иванов И.И.».  (20 баллов)
a = input()
print(a.replace("проблема", "задача").replace("Иванов И.И.", ""))