# Дано 3 числа. Найти минимальное среди них и вывести на экран.
a = float(input("Первое число: "))
b = float(input("Второе число: "))
c = float(input("Третье число: "))

print("минимальное число:", min(a, b, c))
