# Даны три целых числа. Выбрать из них те, которые принадлежат
# интервалу [1,3].
a = int(input("Первое число: "))
b = int(input("Второе число: "))
c = int(input("Третье число: "))

if 1 <= a <= 3:
    print(a)
if 1 <= b <= 3:
    print(b)
if 1 <= c <= 3:
    print(c)