# 1. Вывести на экран все числа от 10 до 20.
for i in range(10, 21):
    print(i)