# 1. Вывести на экран все числа от 10 до n.
for i in range(10, int(input()) + 1):
    print(i)