# 3. Вывести на экран все числа от a до b.
for i in range(int(input()), int(input()) + 1):
    print(i)