# 4. Вывести на экран все числа от n до 1 (n>=1).
for i in range(int(input()), 0, -1):
    print(i)