# 5. Вывести на экран все четные числа от 1 до 20.
for i in range(1, 21):
    if i % 2 == 0:
        print(i)