# 8. Вывести на экран таблицу умножения на 5, то есть
for j in range(1, 11):
    print(5, "*", j, "=", 5 * j)