# Написать программу, которая будет выводить на экран фразу «Hello
# world»

print("Hello world")