# Написать программу, которая будет выводить на экран значение
# выражения 3^100
print(3**100)