# 4. Введите строку с клавиатуры, определите, количество  слов
a = input()
print(len(a.split()))
